/*      DEFINES.H               3/16/89 - 5/14/89       Derek Mui       */
/*      Change the IDTYPE       7/11/92                 D.Mui           */

/* Increased MAXMENU to 31      07/07/92  cjg                           */

/*****************************************************************************/

#include "config.h"
#include "deskdefs.h"
#include "../aes/aes.h"

#ifndef __COMPILER_H__
#include <compiler.h>
#endif
#ifndef __STDINT_H__
#include <stdint.h>
#endif

#include "mobdefs.h"

typedef struct pathnode PNODE;

#include "window.h"

#include "deskrsc.h"
#include "osbind.h"

#ifndef NO_CONST
#  ifdef __GNUC__
#	 define NO_CONST(p) __extension__({ union { const void *cs; void *s; } _x; _x.cs = p; _x.s; })
#  else
#    ifdef __ALCYON__ /* Alcyon parses the cast as function call??? */
#      define NO_CONST(p) p
#    else
#      define NO_CONST(p) ((void *)(p))
#    endif
#  endif
#endif

/*
 * Due to the way the linker works, if we want to create a binary exact image,
 * we have to force symbols that go into the bss section at certain addresses.
 * For this to work, some variables that should be static must be globally
 * visible.
 */
#ifndef STATIC
#if BINEXACT
#  define STATIC
#else
#  define STATIC static
#endif
#endif

/*
 * Should really be OBJECT *, as it was in the original DRI version.
 * Someone messed it up and declared it as long in the Atari version.
 * Even worse, LPTREE was not even used anymore, and all source
 * files changes instead.
 */
typedef intptr_t LPTREE;
typedef intptr_t LPBYTE;

/* file operation definitions   */
#define OP_COUNT      0
#define OP_DELETE     1
#define OP_COPY       2
#define OP_MOVE       3


/* Set Write Allocate mode, clear both caches,
 * and enable them with burst fill.
 */
#define CACHE_ON        0x00003919L
                                
#define CACHE_OFF       0x00000808L     /* Clear and disable both caches. */

#define XCA_ON          0x00003111L     /* read back the cache on       */
#define XCA_OFF         0x00000000L     /* read back cache off          */

#define FA_RDONLY       0x0001
#define FA_HIDDEN       0x0002
#define FA_SYSTEM       0x0004
#define FA_LABEL        0x0008
#define FA_DIREC        0x0010
#define FA_ARCH         0x0020


/*****  APPLICATION FILE TYPE DEFINES      ******/
/*      -1 means match the type                 */

#define TOS     0
#define PRG     (AF_ISGRAF|AF_ISCRYS)
#define TTP     AF_ISPARM
#define DISK    7

#define V_ICON  0               /* view as icon */
#define V_TEXT  1               /* view as text */

#define S_NAME  0               /* sort as name */
#define S_DATE  1
#define S_SIZE  2
#define S_TYPE  3
#define S_NO    4               /* no sort      */

#define MAX_OBS 60
#define MAX_LEVEL       8       /* max level of folder  */

#define APP_NODE 48     /* number of user definable file type   */
#define APP_DESK 48     /* number of desktop icon should equal to number of */
                        /* icons in background dialogue         */
        
#define COPYMAXDEPTH 12

#define L_NOEXIT        0       /* desk loop exit code          */
#define L_LAUNCH        1
#define L_CHGRES        2
#define L_READINF       3


#define F1      0x3b00
#define F2      0x3c00
#define F3      0x3d00
#define F4      0x3e00
#define F5      0x3f00
#define F6      0x4000
#define F7      0x4100
#define F8      0x4200
#define F9      0x4300
#define F10     0x4400  
#define F11     0x5400
#define F12     0x5500
#define F13     0x5600
#define F14     0x5700
#define F15     0x5800
#define F16     0x5900
#define F17     0x5A00
#define F18     0x5B00
#define F19     0x5C00
#define F20     0x5D00  

#define ARGULEN 12

#define E_NOFNODES 100
#define E_NOPNODES 101
#define E_NODNODES 102

#include "app.h"

typedef struct _fnode FNODE;

struct _fnode {
	FNODE    *f_next;
	FNODE    *f_pfndx;
	char     f_junk;				/* to align on even boundaries */
	char     f_attr;
	uint16_t f_time;	/* time */
	uint16_t f_date;	/* date */
	int32_t  f_size;
	char     f_name[LEN_ZFNAME + 1];
	int16_t  f_obid;
	APP      *f_pa;
	BOOLEAN  f_isapp;
};


struct pathnode {
	PNODE *p_next;
	uint16_t p_flags;
	uint16_t p_attr;
	char		p_spec[LEN_ZFPATH];
	FNODE		*p_flist;
	int16_t		p_count;
	int32_t		p_size;
};

typedef struct idtype
{
	int16_t i_type;
	int16_t i_icon;
	ICONBLK i_iblk;
	const char *i_path;
	char i_name[NAMELEN];
} IDTYPE;

/* number of named icons */
#define NUM_IBLKS 6

#define NUM_ADTREES 14


typedef struct {
	/*     0 */ FNODE g_flist[NUM_FNODES];
	/* 16000 */ FNODE *g_favail;
	/* 16004 */ PNODE g_plist[NUM_PNODES];
	/* 16704 */ PNODE *g_pavail;
	/* 16708 */ PNODE *g_phead;
	/* 16712 */ char g_wspec[LEN_ZFPATH];
	/* 16834 */ char *a_wspec;
	/* 16838 */ char g_wdta[PATHLEN];
	/* 16966 */ DTA *a_wdta;
	/* 16970 */ short n_winalloc;
	/* 16972 */ ICONBLK gl_icons[NUM_WOBS + 1];
	/* 21324 */ int16_t g_index[NUM_WOBS + 1];
	/* 21580 */ USERBLK g_udefs[NUM_WOBS + 1];
	/* 22604 */ short g_num;                /* number of points */
	/* 22606 */ int16_t *g_pxy;             /* outline pts to drag */
	/* 22610 */ short g_iview;              /* current view type */
	/* 22612 */ short g_iwext;              /* w,h of extent of a single item */
	/* 22614 */ short g_ihext;
	/* 22616 */ short g_iwint;              /* w,h of interval between items */
	/* 22618 */ short g_ihint;
	/* 22620 */ short g_iwspc;              /* w,h of space used by a single item */
	/* 22622 */ short g_ihspc;
	/* 22624 */ short g_incol;              /* # of cols in full window */
	/* 22626 */ int16_t g_isort;			/* current sort type */
	/* 22628 */ char g_srcpth[PATHLEN];
	/* 22756 */ char g_dstpth[PATHLEN];
	/* 22884 */ char *g_xbuf;               /* data xfer buffer and */
	/* 22888 */ unsigned short g_xlen;      /* length for copying */
	/* 22890 */ DTA g_dtastk[MAX_LEVEL + 1];
	/* 23286 */ int32_t g_nfiles;
	/* 23290 */ int32_t g_ndirs;
	/* 23294 */ int32_t g_size;
	/* 23298 */ char g_tmppth[PATHLEN];
	/* 23426 */ int16_t g_xyobpts[MAX_OBS * 2];
	/* 23666 */ int16_t g_rmsg[8];		    /* general AES message area */
	/* 23682 */ int16_t *p_msgbuf;
	/* 23686 */ GRECT g_desk;
	/* 23694 */ GRECT g_full;				/* full window size value */
	/* 23702 */ char g_cmd[PATHLEN];
	/* 23830 */ char *g_pcmd;
	/* 23834 */ char g_tail[128];
	/* 23962 */ char *g_ptail;
	/* 23966 */ char g_fcb1[36];        /* unused on Atari */
	/* 24002 */ char *a_fcb1;           /* unused on Atari */
	/* 24006 */ char g_fcb2[36];        /* unused on Atari */
	/* 24042 */ char *a_fcb2;           /* unused on Atari */
	/* 24046 */ char *a_alert;			/* rsrc_gaddr result */
	/* 24050 */ OBJECT *g_atree[NUM_ADTREES];	/* resource trees */
	/* 24106 */ int16_t g_croot;        /* current pseudo root */
	/* 24108 */ int16_t g_cwin;         /* current window # */
	/* 24110 */ int16_t g_wlastsel;     /* window holding last selection */
	/* 24112 */ int16_t g_cviewitem;    /* curr. view item chked */
	/* 24114 */ int16_t g_csortitem;    /* curr. sort item chked */
	/* 24116 */ int16_t g_ccopypref;	/* curr. copy pref.	*/
	/* 24118 */ int16_t g_cdelepref;	/* curr. delete pref.	*/
	/* 24120 */ int16_t g_cdclkpref;	/* curr. dblclick pref.*/
	/* 24122 */ int16_t g_icw;
	/* 24124 */ int16_t g_ich;
	/* 24126 */ int16_t g_nmicon;
	/* 24128 */ int16_t g_nmtext;
	/* 24130 */ int16_t g_xyicon[18];
	/* 24166 */ int16_t g_xytext[18];
	/* 24202 */ int16_t g_wicon;		/* desktop icon size */
	/* 24204 */ int16_t g_hicon;
	/* 24206 */ char afile[SIZE_AFILE];
	/* 26254 */ int16_t size_afile;		/* length of recently read desktop.inf */
	/* 26256 */ char appbuf[SIZE_AFILE];
	/* 28304 */ char *g_pbuff;			/* app buffer array */
	/* 28308 */ APP app[NUM_ANODES];	/* app buffer array */
	/* 29204 */ APP *appfree;			/* app buffer free list */
	/* 29208 */ APP *applist;			/* app buffer list */
	/* 29212 */ ICONBLK iconaddr[NUM_IBLKS];	/* desktop icons */
	/* 29416 */ ICONBLK g_iblist[NUM_IBLKS];
	/* 29620 */ int16_t g_ismask[NUM_IBLKS * 2];
	/* 29644 */ CSAVE g_cnxsave;
	/* 30200 */ intptr_t icondata; /* a_datastart */
	/* 30204 */ intptr_t a_buffstart;
	/* 30208 */ OBJECT *g_pscreen;
	/* 30212 */ char ml_files[4];		/* string buffer for # of files BUG: too short */
	/* 30216 */ char ml_dirs[4];		/* string buffer for # of dirs BUG: too short */
	/* 30220 */ int16_t ml_dlfi;
	/* 30222 */ int16_t ml_dlfo;
	/* 30224 */ int16_t ml_dlok;
	/* 30226 */ int16_t ml_dlcn;
	/* 30228 */ BOOLEAN ml_dlpr;
	/* 30230 */ BOOLEAN ml_havebox;
	/* 30232 */ char ml_fsrc[LEN_ZFNAME];
	/* 30245 */ char ml_fdst[LEN_ZFNAME];
	/* 30258 */ char ml_fstr[LEN_ZFNAME];
	/* 30271 */ char ml_ftmp[LEN_ZFNAME];
	/* 30284 */ char gl_lngstr[16];		/* WTF? way too small */
	/* 30300 */ FNODE *ml_pfndx[NUM_FNODES];

	/* attention: must be last, because it makes the structure >32k */
	/* 31900 */ OBJECT g_screen[NUM_SOBS];
	/* 35092 */
} THEDSK;

/*
 * Symbolic "drive letter" for the cartridge.
 * Must be lowercase. This is only handled by
 * the desktop, not by GEMDOS.
 */
#define CHAR_FOR_CARTRIDGE 'c'


/*
 * deskwin.c
 */
extern DESKWIN *g_wlist;				/* head of window list      */
extern uint8_t gl_dta[];

VOID winfo PROTO((DESKWIN *win));
DESKWIN *w_gnext PROTO((NOTHING));
DESKWIN *w_gfirst PROTO((NOTHING));
VOID bottop PROTO((NOTHING));
BOOLEAN path_alloc PROTO((int16_t level));
VOID free_path PROTO((NOTHING));
VOID clr_allwin PROTO((NOTHING));
VOID clr_xwin PROTO((DESKWIN *win, BOOLEAN infoupdate));
VOID srl_verbar PROTO((DESKWIN *win, uint16_t pos));
VOID srl_hzbar PROTO((DESKWIN *win, uint16_t pos));
VOID win_slide PROTO((int16_t handle, uint16_t pos, BOOLEAN vertical));
VOID srl_row PROTO((DESKWIN *win, int16_t row, int16_t dir));
VOID srl_col PROTO((DESKWIN *win, int16_t col, int16_t dir));
