/*      DEFINES.H               3/16/89 - 5/14/89       Derek Mui       */
/*      Change the IDTYPE       7/11/92                 D.Mui           */

/* Increased MAXMENU to 31      07/07/92  cjg                           */

/*****************************************************************************/

#include "config.h"
#include "deskdefs.h"
#include "../aes/aes.h"

#ifndef __COMPILER_H__
#include <compiler.h>
#endif
#ifndef __STDINT_H__
#include <stdint.h>
#endif

#include "mobdefs.h"

typedef struct pathnode PNODE;

#include "window.h"

#include "deskrsc.h"
#include "osbind.h"

#ifndef NO_CONST
#  ifdef __GNUC__
#	 define NO_CONST(p) __extension__({ union { const void *cs; void *s; } _x; _x.cs = p; _x.s; })
#  else
#    ifdef __ALCYON__ /* Alcyon parses the cast as function call??? */
#      define NO_CONST(p) p
#    else
#      define NO_CONST(p) ((void *)(p))
#    endif
#  endif
#endif

/*
 * Due to the way the linker works, if we want to create a binary exact image,
 * we have to force symbols that go into the bss section at certain addresses.
 * For this to work, some variables that should be static must be globally
 * visible.
 */
#ifndef STATIC
#if BINEXACT
#  define STATIC
#else
#  define STATIC static
#endif
#endif

/*
 * Should really be OBJECT *, as it was in the original DRI version.
 * Someone messed it up and declared it as long in the Atari version.
 * Even worse, LPTREE was not even used anymore, and all source
 * files changes instead.
 */
typedef intptr_t LPTREE;

#define CMD_BAT    0xFA
#define CMD_COPY   0xFB
#define CMD_FORMAT 0xFC
#define CMD_PRINT  0xFD
#define CMD_TYPE   0xFE

/* file operation definitions   */
#define OP_COUNT      0
#define OP_DELETE     1
#define OP_COPY       2
#define OP_MOVE       3


/* Set Write Allocate mode, clear both caches,
 * and enable them with burst fill.
 */
#define CACHE_ON        0x00003919L
                                
#define CACHE_OFF       0x00000808L     /* Clear and disable both caches. */

#define XCA_ON          0x00003111L     /* read back the cache on       */
#define XCA_OFF         0x00000000L     /* read back cache off          */

#define FA_RDONLY       0x0001
#define FA_HIDDEN       0x0002
#define FA_SYSTEM       0x0004
#define FA_LABEL        0x0008
#define FA_DIREC        0x0010
#define FA_ARCH         0x0020


/*****  APPLICATION FILE TYPE DEFINES      ******/
/*      -1 means match the type                 */

#define AT_ISFILE   0 /* file                 */
#define AT_ISFOLD   1 /* folder               */
#define AT_ISDISK   2 /* disk or diskette     */
#define AT_ISTRSH   3 /* Trash                */
#define AT_ISCART   4 /* cartridge            */

#define AF_ISCRYS 0x0001			/* is crystal appl.	*/
#define AF_ISGRAF 0x0002			/* is graphic appl.	*/
#define AF_ISDESK 0x0004			/* is placed on desk */
#define AF_ISPARM 0x0008			/* is in need of input */
#define AF_ISFMEM 0x0010			/* is in need of full memory */

#define TOS     0
#define PRG     (AF_ISGRAF|AF_ISCRYS)
#define TTP     AF_ISPARM
#define DISK    7

#define V_ICON  0               /* view as icon */
#define V_TEXT  1               /* view as text */

#define S_NAME  0               /* sort as name */
#define S_DATE  1
#define S_SIZE  2
#define S_TYPE  3
#define S_NO    4               /* no sort      */

#define MAX_OBS 60
#define MAX_LEVEL       8       /* max level of folder  */

#define APP_NODE 48     /* number of user definable file type   */
#define APP_DESK 48     /* number of desktop icon should equal to number of */
                        /* icons in background dialogue         */
        
#define COPYMAXDEPTH 12

#define L_NOEXIT        0       /* desk loop exit code          */
#define L_LAUNCH        1
#define L_CHGRES        2
#define L_READINF       3


#define F1      0x3b00
#define F2      0x3c00
#define F3      0x3d00
#define F4      0x3e00
#define F5      0x3f00
#define F6      0x4000
#define F7      0x4100
#define F8      0x4200
#define F9      0x4300
#define F10     0x4400  
#define F11     0x5400
#define F12     0x5500
#define F13     0x5600
#define F14     0x5700
#define F15     0x5800
#define F16     0x5900
#define F17     0x5A00
#define F18     0x5B00
#define F19     0x5C00
#define F20     0x5D00  

#define ARGULEN 12

#define E_NOFNODES 100
#define E_NOPNODES 101
#define E_NODNODES 102


typedef struct app
{
	/*  0 */ struct app *a_next;    /* app pointer */
	/*  4 */ int16_t a_apptype;
	/*  6 */ int16_t a_type; 		/* file type */
	/*  8 */ int16_t a_obid;		/* object # in desktop tree */
	/* 10 */ char *a_pappl;         /* filename.ext of ap */
	/* 14 */ char *a_pdata; 		/* wildcards of data file */
	/* 18 */ int16_t a_aicon; 		/* application icon # */
	/* 20 */ int16_t a_dicon;       /* data icon # */
	/* 22 */ int16_t a_char;
	/* 24 */ int16_t a_x;
	/* 26 */ int16_t a_y;
	/* 28 */
} APP;

typedef struct _fnode FNODE;

struct _fnode {
	FNODE    *f_next;
	FNODE    *f_pfndx;
	char     f_junk;				/* to align on even boundaries */
	char     f_attr;
	uint16_t f_time;	/* time */
	uint16_t f_date;	/* date */
	int32_t  f_size;
	char     f_name[LEN_ZFNAME + 1];
	int16_t  f_obid;
	APP      *f_pa;
	BOOLEAN  f_isapp;
};


struct pathnode {
	PNODE *p_next;
	uint16_t p_flags;
	uint16_t p_attr;
	char		p_spec[LEN_ZFPATH];
	FNODE		*p_flist;
	uint16_t	p_count;
	int32_t		p_size;
};

typedef struct idtype
{
	int16_t i_type;
	int16_t i_icon;
	ICONBLK i_iblk;
	const char *i_path;
	char i_name[NAMELEN];
} IDTYPE;

#ifndef NUM_IB
#  define NUM_IB 5
#endif

#define NUM_ADTREES 16 /* actually only 14 (NUM_TREE) */

typedef struct {
	/*     0 */ FNODE *g_favail;
	/*     4 */ PNODE g_plist[NUM_PNODES];
	/*   704 */ PNODE *g_pavail;
	/*   708 */ PNODE *g_phead;
	/*   712 */ char g_wdta[PATHLEN];
	/*   840 */ DTA *a_wdta;
	/*   844 */ short n_winalloc;
	/*   846 */ ICONBLK gl_icons[NUM_SOBS];
	/*  9686 */ int16_t g_index[NUM_SOBS];
	/* 10206 */ USERBLK g_udefs[NUM_SOBS];
	/* 10286 */ short g_num;                /* number of points */
	/* 10288 */ int16_t *g_pxy;             /* outline pts to drag */
	/* 10292 */ short g_iview;              /* current view type */
	/* 10294 */ short g_iwext;              /* w,h of extent of a single item */
	/* 10296 */ short g_ihext;
	/* 10298 */ short g_iwint;              /* w,h of interval between items */
	/* 10300 */ short g_ihint;
	/* 10302 */ short g_iwspc;              /* w,h of space used by a single item */
	/* 10304 */ short g_ihspc;
	/* 10306 */ short g_incol;              /* # of cols in full window */
	/* 12308 */ int16_t g_isort;			/* current sort type */
	/* 12310 */ char g_srcpth[PATHLEN];
	/* 12438 */ char g_dstpth[PATHLEN];
	/* 12566 */ char *g_xbuf;               /* data xfer buffer and */
	/* 12570 */ long g_xlen;                /* length for copying */
	/* 12574 */ DTA g_dtastk[MAX_LEVEL + 1];
	/* 12970 */ int32_t g_nfiles;
	/* 12974 */ int32_t g_ndirs;
	/* 12978 */ int32_t g_size;
	/* 12982 */ char g_tmppth[PATHLEN];
	/* 13310 */ int16_t g_xyobpts[MAX_OBS * 2];
	/* 13350 */ int16_t g_rmsg[8];		    /* general AES message area */
	/* 13366 */ int16_t *p_msgbuf;		
	/* 13378 */ GRECT g_desk;
	/* 13370 */ GRECT g_full;				/* full window size value */
	/* 13386 */ char g_cmd[PATHLEN];
	/* 13514 */ char *g_pcmd;
	/* 13518 */ char g_tail[128];
	/* 13646 */ char *g_ptail;
	/* 13650 */ char *str;				/* rsrc_gaddr result */
	/* 13654 */ OBJECT *g_atree[NUM_ADTREES];	/* resource trees */
	/* 13718 */ int16_t g_croot;        /* current pseudo root */
	/* 13720 */ int16_t g_cwin;         /* current window # */
	/* 13722 */ int16_t g_wlastsel;     /* window holding last selection */
	/* 13724 */ int16_t g_cviewitem;    /* curr. view item chked */
	/* 13726 */ int16_t g_csortitem;    /* curr. sort item chked */
	/* 13728 */ int16_t g_ccopypref;	/* curr. copy pref.	*/
	/* 13730 */ int16_t g_cdelepref;	/* curr. delete pref.	*/
	/* 13732 */ int16_t s_bitblt;
	/* 13734 */ int16_t g_covwrpref;	/* curr. overwrite pref.*/
#if TOSVERSION >= 0x162
	int16_t g_ccachepref;				/* only a guess; not written to DESKTOP.INF */
#endif
	/* 13736 */ char *p_cartname;
	/* 13740 */ int16_t g_icw;
	/* 13742 */ int16_t g_ich;
	/* 13744 */ int16_t g_nmicon;
	/* 13746 */ int16_t g_nmtext;
	/* 13748 */ int16_t g_xyicon[18];
	/* 13784 */ int16_t g_xytext[18];
	/* 13820 */ int16_t g_wicon;		/* desktop icon size */
	/* 13822 */ int16_t g_hicon;
	/* 13824 */ char afile[SIZE_AFILE];
	/* 18016 */ int16_t size_afile;		/* length of recently read desktop.inf */
	/* 18018 */ char appbuf[SIZE_AFILE];
	/* 22210 */ APP *appnode;			/* app buffer array */
	/* 22214 */ APP app[NUM_ANODES];	/* app buffer array */
	/* 23110 */ APP *appfree;			/* app buffer free list */
	/* 23114 */ APP *applist;			/* app buffer list */
	/* 23118 */ ICONBLK iconaddr[NUM_IB + 1];	/* desktop icon dialogue address */
	/* 23322 */ ICONBLK g_iblist[NUM_IB + 1];
	/* 23526 */ int16_t g_ismask[(NUM_IB + 1) * 2];
	/* 23550 */ int16_t sitem_save;		/* saved sort item */
	/* 23552 */ int16_t vitem_save;		/* view item */
	/* 23554 */ BOOLEAN ccopy_save;		/* copy ? */
	/* 23556 */ BOOLEAN cdele_save;		/* delete ? */
	/* 23558 */ BOOLEAN cbit_save;		/* bitblt */
	/* 23560 */ int16_t pref_save;		/* screen pref */
	/* 23562 */ BOOLEAN covwr_save;		/* write ? */
#if TOSVERSION >= 0x162
	int16_t ccache_save;				/* only a guess; not written to DESKTOP.INF */
#endif
	/* 23564 */ WSAVE win_save[NUM_WNODES];	/* window process structure */
	/* 24108 */ OBJECT *g_pscreen;
	/* 24112 */ char ml_files[4];		/* string buffer for # of files BUG: too short */
	/* 24116 */ char ml_dirs[4];		/* string buffer for # of dirs BUG: too short */
	/* 24120 */ char o24120[8];			/* unused, but keep it because buffer above may overflow */
	/* 24128 */ BOOLEAN ml_havebox;
	/* 24130 */ BOOLEAN ml_dlpr;
	/* 24132 */ char printname[26];
	/* 24158 */ char ml_fstr[13];
	/* 24171 */ char ml_ftmp[13];
	/* 24184 */ char o24184[16];		/* unused */
	/* 24200 */ OBJECT g_screen[NUM_SOBS];
	/* 30440 */ char autofile[PATHLEN];
	/* 30568 */ unsigned short g_fnnext;
	/* 30570 */ unsigned short g_fnavail;
	/* 30572 */
	
} THEDSK;

/*
 * Symbolic "drive letter" for the cartridge.
 * Must be lowercase. This is only handled by
 * the desktop, not by GEMDOS.
 */
#define CHAR_FOR_CARTRIDGE 'c'


extern char const getall[];
extern char const wilds[];
extern int16_t gl_kstate;

/*
 * deskwin.c
 */
extern GRECT g_winsave[NUM_WNODES];
extern DESKWIN *g_wlist;				/* head of window list      */

VOID winfo PROTO((DESKWIN *win));
DESKWIN *w_gnext PROTO((NOTHING));
DESKWIN *w_gfirst PROTO((NOTHING));
VOID up_allwin PROTO((const char *path, BOOLEAN full));
VOID up_win PROTO((DESKWIN *win));
VOID bottop PROTO((NOTHING));
BOOLEAN path_alloc PROTO((int16_t level));
VOID free_path PROTO((NOTHING));
VOID clr_allwin PROTO((NOTHING));
VOID clr_xwin PROTO((DESKWIN *win, BOOLEAN infoupdate));
VOID srl_verbar PROTO((DESKWIN *win, uint16_t pos));
VOID srl_hzbar PROTO((DESKWIN *win, uint16_t pos));
VOID win_slide PROTO((int16_t handle, uint16_t pos, BOOLEAN vertical));
